Revit 2027 API
OutdoorAirFlowStandard Enumeration
 An enumerated type listing all the possible outdoor airflow standard for a space type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum OutdoorAirFlowStandard
Public Enumeration OutdoorAirFlowStandard
public enum class OutdoorAirFlowStandard
type OutdoorAirFlowStandard
Members
Member name | Value | Description
ByACH | 1 |  By ACH.
ByPeopleAndByArea | 0 |  By people and by area.
MaxByACH_ByArea_ByPeople | 4 |  Maximum(by ACH, by area, by people).
MaxByACH_ByPeopleByArea | 3 |  Maximum(by ACH, by people and by area).
MaxByPeople_ByArea | 2 |  Maximum(by people, by area).
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace